package com.tbgames.app.feature.gameroom.domain.model

object FakeArtistDictionary {
    val categories = mapOf(
        "Профессии" to listOf("Повар", "Врач", "Пожарный", "Полицейский", "Художник", "Строитель", "Космонавт", "Учитель", "Программист", "Фокусник", "Моряк", "Пират", "Музыкант", "Фермер", "Судья", "Шахтер", "Детектив", "Кузнец", "Фотограф", "Водолаз"),
        "Животные" to listOf("Жираф", "Слон", "Крокодил", "Верблюд", "Кенгуру", "Лев", "Носорог", "Обезьяна", "Пингвин", "Еж", "Змея", "Черепаха", "Осьминог", "Кит", "Летучая мышь", "Павлин", "Улитка", "Белка", "Олень", "Хамелеон"),
        "Еда и Напитки" to listOf("Пицца", "Бургер", "Суши", "Мороженое", "Арбуз", "Яблоко", "Банан", "Яичница", "Торт", "Квас", "Сыр", "Виноград", "Гриб", "Багет", "Ананас", "Сосиска", "Пончик", "Кофе", "Шоколад", "Кукуруза"),
        "Фэнтези и Мифы" to listOf("Дракон", "Единорог", "Ведьмак", "Эльф", "Гном", "Русалка", "Вампир", "Оборотень", "Зомби", "Призрак", "Маг", "Пегас", "Циклоп", "Минотавр", "Кентавр", "Тролль", "Фея", "Гоблин", "Кракен", "Джинн"),
        "Транспорт" to listOf("Автомобиль", "Самолет", "Вертолет", "Поезд", "Корабль", "Подводная лодка", "Велосипед", "Мотоцикл", "Ракета", "Трактор", "Трамвай", "Воздушный шар", "Дирижабль", "Скейтборд", "Ролики", "Карета", "Самокат", "Бульдозер", "Лодка", "Метро"),
        "IT и Технологии" to listOf("Ноутбук", "Смартфон", "Компьютерная мышь", "Клавиатура", "Монитор", "Флешка", "Наушники", "Микрофон", "Принтер", "Роутер", "Умные часы", "Камера", "Батарейка", "Дрон", "Сервер", "Робот", "Розетка", "Игровая приставка", "Очки VR", "Компьютерный баг"),
        "Хобби и Игры" to listOf("Шахматы", "Покер", "Рыбалка", "Вязание", "Рисование", "Дартс", "Бильярд", "Боулинг", "Фотография", "Оригами", "Пазл", "Гитара", "Садоводство", "Чтение", "Кемпинг", "Вышивание", "Скейтбординг", "Коллекционирование", "Настольные игры", "Видеоигры"),
        "Одежда и Аксессуары" to listOf("Футболка", "Джинсы", "Платье", "Юбка", "Куртка", "Шарф", "Шапка", "Перчатки", "Носки", "Кроссовки", "Сапоги", "Галстук", "Ремень", "Очки", "Часы", "Кольцо", "Зонт", "Шляпа", "Корона", "Рюкзак"),
        "Оружие" to listOf("Меч", "Лук", "Арбалет", "Топор", "Копье", "Щит", "Пистолет", "Автомат", "Пушка", "Граната", "Бомба", "Нож", "Бумеранг", "Праща", "Хлыст", "Нунчаки", "Сюрикен", "Кастет", "Динамит", "Трезубец"),
        "Здания и Сооружения" to listOf("Замок", "Избушка", "Небоскреб", "Маяк", "Мельница", "Палатка", "Иглу", "Пирамида", "Мост", "Бассейн", "Колодец", "Фонтан", "Стадион", "Церковь", "Теплица", "Завод", "Больница", "Школа", "Гараж", "Тюрьма"),
        "Космос" to listOf("Солнце", "Луна", "Земля", "Сатурн", "Комета", "Астероид", "Черная дыра", "Ракета", "НЛО", "Космонавт", "Спутник", "Телескоп", "Звезда", "Созвездие", "Марсоход", "Галактика", "Метеорит", "Скафандр", "Орбитальная станция", "Инопланетянин"),
        "Музыкальные инструменты" to listOf("Гитара", "Пианино", "Скрипка", "Барабан", "Труба", "Флейта", "Аккордеон", "Арфа", "Балалайка", "Маракасы", "Бубен", "Саксофон", "Синтезатор", "Контрабас", "Губная гармошка", "Ксилофон", "Волынка", "Тарелки", "Виолончель", "Укулеле"),
        "Предметы быта и Дом" to listOf("Утюг", "Пылесос", "Телевизор", "Чайник", "Кастрюля", "Сковорода", "Ножницы", "Расческа", "Зубная щетка", "Мыло", "Полотенце", "Кровать", "Диван", "Стул", "Стол", "Зеркало", "Лампа", "Настенные часы", "Ключ", "Веник"),
        "Спорт" to listOf("Футбол", "Баскетбол", "Теннис", "Волейбол", "Хоккей", "Бокс", "Плавание", "Лыжи", "Сноуборд", "Фигурное катание", "Велоспорт", "Гимнастика", "Тяжелая атлетика", "Гольф", "Бейсбол", "Серфинг", "Альпинизм", "Фехтование", "Биатлон", "Регби"),
        "Природа и Ландшафты" to listOf("Гора", "Вулкан", "Водопад", "Дерево", "Кактус", "Цветок", "Лист", "Пальма", "Остров", "Облако", "Снежинка", "Торнадо", "Радуга", "Пустыня", "Река", "Озеро", "Лес", "Пещера", "Айсберг", "Пляж")
    )

    fun getRandomWord(): Pair<String, String> {
        val randomCategory = categories.keys.random()
        val randomWord = categories[randomCategory]!!.random()
        return Pair(randomCategory, randomWord)
    }
}
